Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSchedule(Autodesk.Revit.DB.ElementId)
Adds a border around the schedule
borderId:
The border to set around the schedule
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSections(Autodesk.Revit.DB.ElementId)
Adds a border around the sections
borderId:
The border to set around the sections
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleData.AddLoadClassification(Autodesk.Revit.DB.ElementId)
Add a Load Classification Id to the array of Load Classifications.
loadClassficationId:
The load classification to add
Returns:
True if success; false if the given Id has already existed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleData.RemoveLoadClassification(System.Int32)
Remove a Load Classification Id from the array of Load Classifications
nIndex:
The index at which to remove the load classification

Autodesk.Revit.DB.Electrical.PanelScheduleData.SetLoadClassifications(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the Load Classifications associated with this panel schedule
loadClassificaions:
The load classifications to assign
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleData.GetLoadClassifications
Gets an array of the load classifications associated with this panel schedule
Returns:
The array of the load classifications

Autodesk.Revit.DB.Electrical.PanelScheduleData.GetNumberOfCircuitRows
Gets the number of rows in the circuit table
Returns:
The number of rows

Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateVerticalHeadersInSection(Autodesk.Revit.DB.SectionType,System.Boolean)
Sets if this header should have vertical text
sectionType:
The section type
bVertical:
Whether headers are vertical or not
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateLoadSummary
Update the load summary section

Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateCircuitTableForTemplate(Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType,System.Int32,System.Boolean)
Redraw the circuit table for a template with the given parameter updates
newType:
The new phase load type of the circuit table
nNumSlots:
The number of circuit slots
bPhasesAsCurrents:
True if the phase columns should be currents, false if they should be loads
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateCircuitTableForInstance(Autodesk.Revit.DB.FamilyInstance)
Redraw the circuit table for the given panel with the given parameter updates
pPanel:
The panel that this circuit table is being drawn for
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateIsSectionHidden(Autodesk.Revit.DB.SectionType,System.Boolean)
Update if this section is hidden or not
sectionType:
The Section Type
bHide:
Whether to hide this section or not
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsSymmetric
Check if this panel schedule is symmetric
Returns:
True if this panel schedule is symmetric, false otherwise.

Autodesk.Revit.DB.Electrical.PanelScheduleData.PhasesAsCurrents
If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function

Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowSlotFromDeviceInsteadOfTemplate
When true, the number of rows in an instance will be the number of poles on the associated device, not a set number

Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowMultipleRowsForMultiphaseCircuits
shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise
Remarks:
only applicable to one column formats

Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowCircuitNumberOnOneRowForMultiphaseCircuits
Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise
Remarks:
Only applicable to two column formats

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsPanelSinglePhase
Identifies if the panel is single phase.
Remarks:
If true, the panel is single phase. If false, the panel is 3-phase.

Autodesk.Revit.DB.Electrical.PanelScheduleData.BodyShowsVerticalHeaders
Shows text in the Load Summary section's headers vertically instead of horizontally
Remarks:
Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)

Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsVerticalHeaders
Shows text in the Load Summary section's headers vertically instead of horizontally
Remarks:
Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)

Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsGroups
Show groups of load classifications in the load summary section

Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsOnlyConnectedLoads
Show only the connected load classifications in the summary section

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsThirdPhaseHidden
True if the user wishes to hide the 3rd phase column of a single phase panel

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsFooterSectionHidden
True if the user wishes to hide the footer section; setting this value must go through the appropriate update function

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsSummarySectionHidden
True if the user wishes to hide the summary section; setting this value must go through the appropriate update function

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsHeaderSectionHidden
True if the user wishes to hide the header section; setting this value must go through the appropriate update function

Autodesk.Revit.DB.Electrical.PanelScheduleData.NumberOfSlots
The number of slots in the panel schedule; setting this value must go through the appropriate update function

Autodesk.Revit.DB.Electrical.PanelScheduleData.PhaseLoadType
This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function

Autodesk.Revit.DB.Electrical.PanelScheduleData.PanelConfiguration
The panel configuration of this panel schedule

Autodesk.Revit.DB.Electrical.PanelScheduleData.ScheduleType
The panel schedule type of this panel schedule

Autodesk.Revit.DB.Electrical.PanelScheduleData.BorderAroundSchedule
Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet

Autodesk.Revit.DB.Electrical.PanelScheduleData.BorderAroundSections
Places a border (GraphicStyle element) around each section, visible only on the instance and sheet

Autodesk.Revit.DB.Electrical.PanelScheduleData
The PanelScheduleData class holds most of the data that describe
the layout, appearance, and style of the rows, columns, and cells
of a panel schedule